ghix-tools/test/web/scripts/NV_web/resources/QEPFN_1mem.txt

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
<header></header>
 <soap:Body>
      <ns10:AccountTransferRequest ns3:atVersionText="2.3" xmlns:ns10="http://at.dsh.cms.gov/exchange/1.0" xmlns:ns3="http://at.dsh.cms.gov/extension/1.0" xmlns:ns1="http://niem.gov/niem/structures/2.0" xmlns:ns2="http://niem.gov/niem/niem-core/2.0" xmlns:ns4="http://hix.cms.gov/0.1/hix-core" xmlns:ns5="http://hix.cms.gov/0.1/hix-ee" xmlns:ns6="http://niem.gov/niem/domains/screening/2.1" xmlns:ns7="http://hix.cms.gov/0.1/hix-pm" xmlns:ns8="http://niem.gov/niem/appinfo/2.0" xmlns:ns9="http://niem.gov/niem/appinfo/2.1">
         <ns3:TransferHeader>
            <ns3:TransferActivity>
               <ns2:ActivityIdentification>
                  <ns2:IdentificationID>IDM56655d3282ffb</ns2:IdentificationID>
               </ns2:ActivityIdentification>
               <ns2:ActivityDate>
                  <ns2:DateTime>2018-12-01T19:20:02</ns2:DateTime>
               </ns2:ActivityDate>
               <ns3:TransferActivityReferralQuantity>1</ns3:TransferActivityReferralQuantity>
               <ns3:RecipientTransferActivityCode>Exchange</ns3:RecipientTransferActivityCode>
            </ns3:TransferActivity>
         </ns3:TransferHeader>
         <ns4:Sender ns1:id="SenderMedicaid">
            <ns4:InformationExchangeSystemCategoryCode>MedicaidAgency</ns4:InformationExchangeSystemCategoryCode>
            <ns4:InformationExchangeSystemStateCode>NV</ns4:InformationExchangeSystemStateCode>
         </ns4:Sender>
         <ns4:Receiver ns1:id="ReceiverExchange">
            <ns4:InformationExchangeSystemCategoryCode>Exchange</ns4:InformationExchangeSystemCategoryCode>
         </ns4:Receiver>
         <ns5:InsuranceApplication>
            <ns4:ApplicationCreation xsi:type="ns4:ActivityType" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
               <ns2:ActivityDate>
                  <ns2:Date>2018-12-01</ns2:Date>
               </ns2:ActivityDate>
            </ns4:ApplicationCreation>
            <ns4:ApplicationSubmission xsi:type="ns4:ActivityType" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
               <ns2:ActivityDate>
                  <ns2:Date>2018-12-01</ns2:Date>
               </ns2:ActivityDate>
            </ns4:ApplicationSubmission>
            <ns4:ApplicationIdentification>
               <ns2:IdentificationID>NVapan34ca12ricky</ns2:IdentificationID>
               <ns2:IdentificationCategoryText>HouseholdCaseID</ns2:IdentificationCategoryText>
            </ns4:ApplicationIdentification>
            <ns4:ApplicationIdentification>
               <ns2:IdentificationID>appID214testing</ns2:IdentificationID>
               <ns2:IdentificationCategoryText>ApplicationID</ns2:IdentificationCategoryText>
            </ns4:ApplicationIdentification>
            <ns5:InsuranceApplicant>
               <ns4:RoleOfPersonReference ns1:ref="Person1"/>
               <ns5:InsuranceApplicantFixedAddressIndicator>true</ns5:InsuranceApplicantFixedAddressIndicator>
               <ns5:InsuranceApplicantLawfulPresenceStatus>
                  <ns5:LawfulPresenceStatusArrivedBefore1996Indicator>false</ns5:LawfulPresenceStatusArrivedBefore1996Indicator>
                  <ns5:LawfulPresenceStatusEligibility xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
               </ns5:InsuranceApplicantLawfulPresenceStatus>
               <ns5:InsuranceApplicantNonESIPolicy>
						<ns5:InsurancePremium>
							<ns5:InsurancePremiumAmount>42.42</ns5:InsurancePremiumAmount>
						</ns5:InsurancePremium>
			</ns5:InsuranceApplicantNonESIPolicy>
               <ns5:APTCEligibility ns1:id="Person1APTCEligibilityRef">
                  <ns5:EligibilityDateRange>
                     <ns2:StartDate>
                        <ns2:Date>2019-01-01</ns2:Date>
                     </ns2:StartDate>
                     <ns2:EndDate>
                        <ns2:Date>2019-12-31</ns2:Date>
                     </ns2:EndDate>
                  </ns5:EligibilityDateRange>
                  <ns5:EligibilityDetermination>
                     <ns2:ActivityDate>
                        <ns2:DateTime>2018-09-01T19:20:02</ns2:DateTime>
                     </ns2:ActivityDate>
                  </ns5:EligibilityDetermination>
                  <ns5:EligibilityReasonText>999</ns5:EligibilityReasonText>
                  <ns5:EligibilityIndicator>true</ns5:EligibilityIndicator>
                  <ns5:APTC>
                     <ns5:APTCMaximumAmount>150</ns5:APTCMaximumAmount>
                  </ns5:APTC>
               </ns5:APTCEligibility>
               <ns5:CSREligibility ns1:id="Person1CSREligibilityRef">
                  <ns5:EligibilityDateRange>
                     <ns2:StartDate>
                        <ns2:Date>2019-01-01</ns2:Date>
                     </ns2:StartDate>
                     <ns2:EndDate>
                        <ns2:Date>2019-12-31</ns2:Date>
                     </ns2:EndDate>
                  </ns5:EligibilityDateRange>
                  <ns5:EligibilityReasonText>999</ns5:EligibilityReasonText>
                  <ns5:EligibilityIndicator>true</ns5:EligibilityIndicator>
                  <ns5:CSRAdvancePayment>
                     <ns5:CSRCategoryAlphaCode>73PercentActuarialVarianceLevelSilverPlanCSR</ns5:CSRCategoryAlphaCode>
                  </ns5:CSRAdvancePayment>
               </ns5:CSREligibility>
               <ns5:ExchangeEligibility ns1:id="Person1ExchangeEligibilityRef">
                  <ns5:EligibilityDateRange>
                     <ns2:StartDate>
                        <ns2:Date>2019-01-01</ns2:Date>
                     </ns2:StartDate>
                     <ns2:EndDate>
                        <ns2:Date>2019-12-31</ns2:Date>
                     </ns2:EndDate>
                  </ns5:EligibilityDateRange>
                  <ns5:EligibilityDetermination>
                     <ns2:ActivityDate>
                        <ns2:DateTime>2018-04-14T16:38:41</ns2:DateTime>
                     </ns2:ActivityDate>Fperson3
                  </ns5:EligibilityDetermination>
                  <ns5:EligibilityReasonText>999</ns5:EligibilityReasonText>
                  <ns5:EligibilityIndicator>true</ns5:EligibilityIndicator>
               </ns5:ExchangeEligibility>
               <ns5:ReferralActivity>
                  <ns2:ActivityIdentification>
                     <ns2:IdentificationID>335465780</ns2:IdentificationID>
                  </ns2:ActivityIdentification>
                  <ns2:ActivityDate>
                     <ns2:DateTime>2018-09-01T19:20:02</ns2:DateTime>
                  </ns2:ActivityDate>
                  <ns5:ReferralActivitySenderReference ns1:ref="SenderMedicaid"/>
                  <ns5:ReferralActivityReceiverReference ns1:ref="ReceiverExchange"/>
                  <ns5:ReferralActivityStatus>
                     <ns5:ReferralActivityStatusCode>Updated</ns5:ReferralActivityStatusCode>
                  </ns5:ReferralActivityStatus>
                  <ns5:ReferralActivityEligibilityReasonReference ns1:ref="Person1APTCEligibilityRef"/>
                  <ns5:ReferralActivityEligibilityReasonReference ns1:ref="Person1CSREligibilityRef"/>
               </ns5:ReferralActivity>
            </ns5:InsuranceApplicant>
            <ns5:InsuranceApplicationRequestingFinancialAssistanceIndicator>true</ns5:InsuranceApplicationRequestingFinancialAssistanceIndicator>
            <ns5:InsuranceApplicationCoverageRenewalYearQuantity xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <ns5:SSFSigner>
               <ns4:RoleOfPersonReference ns1:ref="Person1"/>
               <ns5:Signature>
                  <ns4:SignatureDate>
                     <ns2:Date>2018-01-01</ns2:Date>
                  </ns4:SignatureDate>
               </ns5:Signature>
               <ns5:SSFAttestation>
                  <ns5:SSFAttestationCollectionsAgreementIndicator>true</ns5:SSFAttestationCollectionsAgreementIndicator>
                  <ns5:SSFAttestationMedicaidObligationsIndicator>true</ns5:SSFAttestationMedicaidObligationsIndicator>
                  <ns5:SSFAttestationNonPerjuryIndicator>true</ns5:SSFAttestationNonPerjuryIndicator>
                  <ns5:SSFAttestationNotIncarceratedIndicator>true</ns5:SSFAttestationNotIncarceratedIndicator>
                  <ns5:SSFAttestationInformationChangesIndicator>true</ns5:SSFAttestationInformationChangesIndicator>
                  <ns5:SSFAttestationApplicationTermsIndicator>true</ns5:SSFAttestationApplicationTermsIndicator>
               </ns5:SSFAttestation>
            </ns5:SSFSigner>
            <ns5:InsuranceApplicationRequestingMedicaidIndicator>false</ns5:InsuranceApplicationRequestingMedicaidIndicator>
            <ns5:SSFPrimaryContact>
               <ns4:RoleOfPersonReference ns1:ref="Person1"/>
               <ns5:SSFPrimaryContactPreferenceCode>Mail</ns5:SSFPrimaryContactPreferenceCode>
            </ns5:SSFPrimaryContact>
            <ns5:InsuranceApplicationTaxReturnAccessIndicator>true</ns5:InsuranceApplicationTaxReturnAccessIndicator>
            <ns5:ApplicationExtension>
               <ns5:CoverageYear>2019</ns5:CoverageYear>
            </ns5:ApplicationExtension>
         </ns5:InsuranceApplication>
         <ns4:Person ns1:id="Person1">
            <ns2:PersonBirthDate>
               <ns2:Date>1980-01-01</ns2:Date>
            </ns2:PersonBirthDate>
            <ns2:PersonEthnicityText>Hispanic</ns2:PersonEthnicityText>
            <ns2:PersonName>
               <ns2:PersonGivenName>Supy</ns2:PersonGivenName>
               <ns2:PersonSurName>Rao</ns2:PersonSurName>
            </ns2:PersonName>
            <ns2:PersonRaceText>White</ns2:PersonRaceText>
            <ns2:PersonSexText>Male</ns2:PersonSexText>
            <ns2:PersonSSNIdentification>
               <ns2:IdentificationID>293882529</ns2:IdentificationID>
            </ns2:PersonSSNIdentification>
            <ns2:PersonUSCitizenIndicator>true</ns2:PersonUSCitizenIndicator>
            <ns4:TribalAugmentation>
               <ns4:PersonAmericanIndianOrAlaskaNativeIndicator>false</ns4:PersonAmericanIndianOrAlaskaNativeIndicator>
               <ns2:LocationStateUSPostalServiceCode xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            </ns4:TribalAugmentation>
            <ns4:PersonAugmentation>
               <ns4:PersonContactInformationAssociation>
                  <ns2:AssociationBeginDate xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                  <ns2:ContactInformationIsPrimaryIndicator>false</ns2:ContactInformationIsPrimaryIndicator>
                  <ns4:ContactInformation>
                     <ns2:ContactMailingAddress>
                        <ns2:StructuredAddress>
                           <ns2:LocationStreet>
                              <ns2:StreetFullText>6671 Las Vegas Blvd S</ns2:StreetFullText>
                           </ns2:LocationStreet>
                           <ns2:LocationCityName>Las Vegas</ns2:LocationCityName>
                           <ns2:LocationCountyCode>003</ns2:LocationCountyCode>
                           <ns2:LocationStateUSPostalServiceCode>NV</ns2:LocationStateUSPostalServiceCode>
                           <ns2:LocationPostalCode>89119</ns2:LocationPostalCode>
                        </ns2:StructuredAddress>
                     </ns2:ContactMailingAddress>
                  </ns4:ContactInformation>
                  <ns4:ContactInformationCategoryCode>Mailing</ns4:ContactInformationCategoryCode>
               </ns4:PersonContactInformationAssociation>
               <ns4:PersonContactInformationAssociation>
                  <ns2:AssociationBeginDate xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                  <ns2:ContactInformationIsPrimaryIndicator>false</ns2:ContactInformationIsPrimaryIndicator>
                  <ns4:ContactInformation>
                     <ns2:ContactMailingAddress>
                        <ns2:StructuredAddress>
                           <ns2:LocationStreet>
                              <ns2:StreetFullText>6671 Las Vegas Blvd S</ns2:StreetFullText>
                           </ns2:LocationStreet>
                           <ns2:LocationCityName>Las Vegas</ns2:LocationCityName>
                           <ns2:LocationCountyCode>003</ns2:LocationCountyCode>
                           <ns2:LocationStateUSPostalServiceCode>NV</ns2:LocationStateUSPostalServiceCode>
                           <ns2:LocationPostalCode>89119</ns2:LocationPostalCode>
                        </ns2:StructuredAddress>
                     </ns2:ContactMailingAddress>
                  </ns4:ContactInformation>
                  <ns4:ContactInformationCategoryCode>Home</ns4:ContactInformationCategoryCode>
               </ns4:PersonContactInformationAssociation>
               <ns4:PersonContactInformationAssociation>
                  <ns2:AssociationBeginDate xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                  <ns2:ContactInformationIsPrimaryIndicator>true</ns2:ContactInformationIsPrimaryIndicator>
                  <ns4:ContactInformation>
                     <ns2:ContactTelephoneNumber>
                        <ns2:FullTelephoneNumber>
                           <ns2:TelephoneNumberFullID>4089905708</ns2:TelephoneNumberFullID>
                        </ns2:FullTelephoneNumber>
                     </ns2:ContactTelephoneNumber>
                  </ns4:ContactInformation>
                  <ns4:ContactInformationCategoryCode>Home</ns4:ContactInformationCategoryCode>
               </ns4:PersonContactInformationAssociation>
               <ns4:PersonContactInformationAssociation>
                  <ns2:AssociationBeginDate xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                  <ns2:ContactInformationIsPrimaryIndicator>false</ns2:ContactInformationIsPrimaryIndicator>
                  <ns4:ContactInformation>
                     <ns2:ContactEmailID>ricky678@yopmail.com</ns2:ContactEmailID>
                  </ns4:ContactInformation>
               </ns4:PersonContactInformationAssociation>
               <ns4:PersonPregnancyStatus xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
               <ns4:PersonMedicaidIdentification>
                  <ns2:IdentificationID>MedPersonOne01</ns2:IdentificationID>
               </ns4:PersonMedicaidIdentification>
               <ns4:PersonMarriedIndicator>false</ns4:PersonMarriedIndicator>
            </ns4:PersonAugmentation>
         </ns4:Person>
         <ns5:TaxReturn>
            <ns5:TaxHousehold>
               <ns5:HouseholdIncome>
                  <ns4:IncomeFederalPovertyLevelPercent>149</ns4:IncomeFederalPovertyLevelPercent>
                  <ns4:IncomeEmploymentDescriptionText xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                  <ns4:IncomeUnemploymentSourceText xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
               </ns5:HouseholdIncome>
               <ns5:HouseholdSizeQuantity>1</ns5:HouseholdSizeQuantity>
               <ns5:PrimaryTaxFiler>
                  <ns4:RoleOfPersonReference ns1:ref="Person1"/>
               </ns5:PrimaryTaxFiler>
            </ns5:TaxHousehold>
         </ns5:TaxReturn>
         <ns3:PhysicalHousehold>
            <ns5:HouseholdMemberReference ns1:ref="Person1"/>
         </ns3:PhysicalHousehold>
      </ns10:AccountTransferRequest>
   </soap:Body>
</soap:Envelope>